tests/stress/artillery-config.yml
# Nails & Co — Artillery Load Test Configuration
#
# Usage:
#   npx artillery run tests/stress/artillery-config.yml
#   npx artillery run tests/stress/artillery-config.yml --output tests/stress/artillery-report.json
#   npx artillery report tests/stress/artillery-report.json
#
# Environment variable for target:
#   ARTILLERY_TARGET=https://nails-backend.fly.dev npx artillery run tests/stress/artillery-config.yml

config:
  target: "{{ $env.ARTILLERY_TARGET || 'https://nailsco-backend.fly.dev' }}"
  environments:
    production:
      target: "https://nails-backend.fly.dev"
    local:
      target: "http://localhost:3001"
  http:
    timeout: 10
    pool: 10
  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"
  phases:
    # Phase 1: Warm-up — gentle ramp-up
    - name: "warm-up"
      duration: 20
      arrivalRate: 3
      rampTo: 5

    # Phase 2: Steady load — simulate a normal busy day
    - name: "normal-load"
      duration: 30
      arrivalRate: 15

    # Phase 3: Peak load — realistic max for 512MB/1CPU Fly.io machine
    - name: "peak-load"
      duration: 20
      arrivalRate: 30

    # Phase 4: Cool down
    - name: "cool-down"
      duration: 10
      arrivalRate: 5

  ensure:
    # Acceptance criteria
    p95: 1500        # 95th percentile must be < 1500ms
    maxErrorRate: 1  # Error rate must be < 1%

  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  # -------------------------------------------------------------------------
  # Scenario 1: Browse availability (most common flow — 60% of traffic)
  # -------------------------------------------------------------------------
  - name: "Check availability"
    weight: 60
    flow:
      - get:
          url: "/api/v1/services"
          name: "GET services"
          expect:
            - statusCode: 200

      - get:
          url: "/api/v1/staff"
          name: "GET staff"
          expect:
            - statusCode: 200

      - get:
          url: "/api/v1/bookings/available-slots"
          name: "GET available-slots"
          qs:
            date: "2027-07-15"
            staffId: "20b1c2d3-e4f5-47a6-b7c8-d9e0f1a2b301"
          expect:
            - statusCode: 200

  # -------------------------------------------------------------------------
  # Scenario 2: Extended availability browse — two dates, same staff (30% of traffic)
  # (Replaced POST /bookings which required CSRF token — always resulted in 403)
  # -------------------------------------------------------------------------
  - name: "Extended availability browse"
    weight: 30
    flow:
      - get:
          url: "/api/v1/services"
          name: "GET services"

      - get:
          url: "/api/v1/staff"
          name: "GET staff"

      - get:
          url: "/api/v1/bookings/available-slots"
          name: "GET available-slots (current week)"
          qs:
            date: "2027-07-15"
            staffId: "20b1c2d3-e4f5-47a6-b7c8-d9e0f1a2b301"
          expect:
            - statusCode: 200

      - get:
          url: "/api/v1/bookings/available-slots"
          name: "GET available-slots (next week)"
          qs:
            date: "2027-07-22"
            staffId: "20b1c2d3-e4f5-47a6-b7c8-d9e0f1a2b301"
          expect:
            - statusCode: 200

  # -------------------------------------------------------------------------
  # Scenario 3: Catalog burst — unauthenticated public reads (10% of traffic)
  # (Replaced GET /customers which requires JWT — always resulted in 401)
  # -------------------------------------------------------------------------
  - name: "Catalog burst"
    weight: 10
    flow:
      - get:
          url: "/api/v1/addons?page=1&limit=20"
          name: "GET addons"
          expect:
            - statusCode: 200

      - get:
          url: "/api/v1/categories"
          name: "GET categories"
          expect:
            - statusCode: 200

      - get:
          url: "/api/v1/services"
          name: "GET services (admin)"
          expect:
            - statusCode: 200